waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/sdkconfig.defaults
# ESP32-S3-Touch-AMOLED-1.75 Brookesia firmware defaults (ESP-IDF 5.5)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# Keep the full 8 MB available to application assets and task stacks. The
# firmware's mapped IROM/DROM segments fit in flash, so copying ~5.7 MB of
# instructions and read-only data into PSRAM only starves AIChats and LVGL.
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=4096
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# Brookesia installs nine applications and initializes the display/audio BSP
# from app_main. The ESP-IDF default 3584-byte main stack overflows during
# CO5300/LVGL bring-up; use the proven Brookesia speaker profile.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=20480
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=2000000
CONFIG_FREERTOS_HZ=1000
CONFIG_VFS_MAX_COUNT=20
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FPS_STATS=y
CONFIG_BROOKESIA_DISPLAY_PERF_LOG=y
CONFIG_BROOKESIA_DISPLAY_PERF_LOG_PERIOD_MS=2000
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_BUILD_EXAMPLES=n

CONFIG_ESP_BROOKESIA_ENABLE_AI_FRAMEWORK=n
CONFIG_ESP_BROOKESIA_GUI_ENABLE_ANIM_PLAYER=n
CONFIG_ESP_BROOKESIA_ENABLE_SERVICES=n
CONFIG_ESP_BROOKESIA_SYSTEMS_ENABLE_SPEAKER=n
CONFIG_BOOST_MATH_ENABLED=n
CONFIG_BOOST_SERIALIZATION_ENABLED=n

# AIChats wake word (WakeNet 9: "Ni Hao Xiao Zhi") and local UI defaults.
CONFIG_SR_WN_WN9_NIHAOXIAOZHI_TTS=y
CONFIG_XIAOZHI_APP_UI_LANGUAGE_ENGLISH=y
CONFIG_XIAOZHI_APP_TRANSPORT_WEBSOCKET=y
CONFIG_XIAOZHI_INFO_TIMEOUT_MS=8000

# Keep network queues useful for streamed conversation audio without applying
# the P4 reference's 32 MB-PSRAM-sized remote-Wi-Fi buffer profile.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=24
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=24
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16

CONFIG_BSP_I2C_CLK_SPEED_HZ=400000
CONFIG_BSP_SPIFFS_PARTITION_LABEL="storage"
CONFIG_BSP_SPIFFS_MOUNT_POINT="/spiffs"
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"

# SD media libraries need normal long UTF-8 filenames.  CP936 keeps Chinese
# FAT long names interoperable with Windows while the VFS-facing API is UTF-8.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE_936=y
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_FS_LOCK=16
